{
  "backend/main.mo": "Motoko backend actor defining user profiles and CRUD operations for semesters, courses, schedules, and absences with per-user access control.",
  "feature_evidence.json": "Feature evidence record listing files and components involved in improved semester creation error handling.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/android/.gitignore": "Git ignore rules for Android build artifacts, IDE files, logs, and generated content.",
  "frontend/capacitor.config.ts": "Capacitor configuration for the Android app including app metadata, server settings, and plugin options.",
  "frontend/docs/android-apk-build.md": "Markdown guide explaining how to build the Android APK using Capacitor and Android Studio.",
  "frontend/index.css": "Global Tailwind-based styles defining light and dark theme variables with a terracotta color system.",
  "frontend/index.html": "Base HTML entry file configuring viewport settings, mobile web app tags, theme color, and root script mount.",
  "frontend/src/App.tsx": "Main React app entry defining router setup, authentication flow, profile setup gating, and theming.",
  "frontend/src/components/AsyncState.tsx": "UI component handling loading, error, and empty states with alerts and fallback messaging.",
  "frontend/src/components/AuthGate.tsx": "Authentication gate showing login UI and context-specific error messages for native vs browser environments.",
  "frontend/src/components/layout/AppShell.tsx": "Main app layout with navigation, user menu, and logout handling supporting desktop and mobile views.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Dialog for entering and submitting a user's name and optional email to create their profile.",
  "frontend/src/components/schedule/ScheduleItemDialog.tsx": "Dialog for creating or editing a schedule item with course, day, and time selection.",
  "frontend/src/hooks/useAbsences.ts": "React Query hooks for fetching and adding absence records using the actor API.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated or anonymous backend actor, refreshing dependent queries on change.",
  "frontend/src/hooks/useCourses.ts": "Hooks for retrieving and creating courses through the actor API with React Query.",
  "frontend/src/hooks/useCurrentUser.ts": "Hooks to fetch and save the current user's profile via the actor API.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity auth provider and hook handling identity loading, login, and logout state.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file exporting nothing; feature-specific hooks live elsewhere.",
  "frontend/src/hooks/useSchedule.ts": "Hooks for fetching and creating schedule items through the actor API.",
  "frontend/src/hooks/useSemesters.ts": "Hooks for retrieving and creating semesters using the actor API.",
  "frontend/src/index.css": "Defines Tailwind layers and a warm color theme with light/dark mode plus mobile-focused layout fixes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AbsencesPage.tsx": "Displays absences per course and provides a dialog for recording new absences.",
  "frontend/src/pages/ManagePage.tsx": "Manages semesters and courses, including creation dialogs and validation.",
  "frontend/src/pages/ReportsPage.tsx": "Shows high-level semester reports with absence summaries and per‑course breakdowns.",
  "frontend/src/pages/WeeklyHoursPage.tsx": "Placeholder page outlining planned weekly hours tracking features.",
  "frontend/src/pages/WeeklySchedulePage.tsx": "Displays weekly schedule items grouped by day and supports adding or editing entries.",
  "frontend/src/state/selection.ts": "Provides React hooks for selecting and persisting week ranges and semesters using localStorage.",
  "frontend/src/utils/getErrorMessage.ts": "Normalizes unknown error values into readable strings with fallbacks for toast display.",
  "frontend/src/utils/isNativeApp.ts": "Detects Capacitor or WebView environments and returns the running platform (android, ios, or web).",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in sessionStorage, and managing hash/query routing state.",
  "frontend/tailwind.config.js": "Tailwind CSS config defining theme extensions, colors, typography, container settings, and animations.",
  "project_state.json": "Project metadata describing app scope, architecture notes, known issues, and implemented features."
}